# 리스트

# 대괄호[] 안에 값 목록을 넣고, 각 요소는 ,컴마로 구분하여 작성
# 리스트명 = [요소1, 요소2, 요소3, ...]

a = []                              # 빈 리스트
b = [1, 2, 3]                       # 숫자 리스트
c = ['a', 'b', 'c']                 # 문자 리스트
d = [1, 2, 'a', 'b']                # 혼합형 리스트

# 리스트 인덱스
# 리스트의 각 요소는 인덱스 번호로 접근할 수 있다
a = [1, 2, 3]
a[0]    #첫번째요소 1
a[1]    #두번째요소 2
a[2]    #세번째요소 3
a[-1]   #마지막요소 3

# 리스트 슬라이스
# 리스트[시작위치:마지막위치] 
a = [1, 2, 3, 4, 5]
a[0:2]  #[1, 2]
a[3:6]  #[3, 4, 5]
a[:2]   #[1, 2]
a[2:]   #[3, 4, 5]

# 리스트 관련 연산자

# 리스트 연결하기
a = [1, 2, 3]
b = [4, 5, 6]
a + b #[1, 2, 3, 4, 5, 6]

# 리스트 반복하기
a = [1, 2, 3]
a * 3 #[1, 2, 3, 1, 2, 3, 1, 2, 3]

# 리스트 요소 추가, 수정, 삭제 함수

# 새로운 요소 추가 append
# 리스트 끝에 추가됨
a = [1, 2, 3]
a.append(4)     #[1, 2, 3, 4]
a.append(5)     #[1, 2, 3, 4, 5]

# 특정 위치에 새로운 요소 추가 insert(위치,새로운값)
a = [1, 2, 3]
a.insert(0, 4) #[4, 1, 2, 3] # 0번째 자리에 4를 삽입
a.insert(3, 5) #[4, 1, 2, 5, 3]

# 리스트 요소 수정하기
a = [1, 2, 3]
a[2] = 4 #[1, 2, 4]

# del을 사용해 리스트 요소 삭제하기
# del 리스트(인덱스)
a = [1, 2, 3]
del a[1] #[1, 3]

# remove 함수를 사용해 리스트 요소 삭제하기
# remove(값)
a = [1, 2, 3]
a.remove(3) #[1, 2]

# 리스트 관련 함수

# 리스트 길이 구하기
a = [1, 2, 3]
len(a) #3

# 위치 찾기 index(값)
a = [1, 2, 3]
a.index(1) #0
a.index(3) #2

# 리스트의 요소를 꺼내면서 삭제하기 pop
a = [1, 2, 3]
a.pop(1)    #2
a           #[1, 3]

a.pop() #3 인덱스가 없으면 마지막 요소 선택
a       #[1, 2]


#############################

# 리스트 정렬 sort
a = [1, 4, 3, 2]
a.sort() #[1, 2, 3, 4]

a = ['a', 'c', 'b']
a.sort() #['a', 'b', 'c']

# 리스트 뒤집기 reverse
a = ['a', 'c', 'b']
a.reverse() #['b', 'c', 'a']

# 리스트에 포함된 요소 x의 개수 세기 count
a = [1, 2, 3, 1]
a.count(1) #2

