# 1. 25와 7을 더한 값을 출력하세요
print(25 + 7)      # 32

# 2. 100에서 45를 뺀 값을 출력하세요
print(100 - 45)    # 55

# 3. 12에 8을 곱한 값을 출력하세요
print(12 * 8)      # 96

# 4. 17을 5으로 나눴을 때 결과를 출력하세요
print(17 / 5)     # 3.4

# 5. 5로 나눴을 때 몫과 나머지를 출력하세요
print(17 // 5)   # 3
print(17 % 5)    # 2

# 6. 다음 코드를 실행하지 말고, 예상되는 결과를 작성하세요
d = 1.2
f = 0.9
i = int(d)           # ?
i2 = int(f)          # ?
i3 = int(d) + int(f) # ?
i4 = int(d + f)      # ?

# # 결과
# i = int(d)           # 1.2 → 1
# i2 = int(f)          # 0.9 → 0
# i3 = int(d) + int(f) # 1 + 0 → 1
# i4 = int(d + f)      # (1.2 + 0.9) = 2.1 → 2

# # int로 형변환을 하면 소수점 이하는 버린다
# print(i)   # 1
# print(i2)  # 0
# print(i3)  # 1
# print(i4)  # 2

