# 1. 문자열 "1"과 숫자 1를 더해 결과 2를 출력하세요
print(int("1") + 1)

# 2. 문자열 "1.5"와 숫자 1.5를 더해 결과 3.0를 출력하세요
print(float("1.5") + 1.5)     # 3.0

# 3. "Hello" 와 "Python"를 +연산자로 연결해 출력하세요
# 결과: HelloPython
print("Hello" + "Python")

# 4. *연산자을 사용해 "야호"를 3번 출력하세요
# 결과: 야호!야호!야호!
print("야호!" * 3)

# 5. "멍"을 2번, "냥"을 3번 반복해 출력하세요
# 결과: 멍멍냥냥냥
print("멍" * 2 + "냥" * 3)

# 6. 인덱스를 사용해 문자열 "text" 에서 첫번째 글자를 출력하세요
# 결과: t
a = "text"
print(a[0])

# 7. 인덱스를 사용해 문자열 "text" 에서 마지막 글자를 출력하세요
# 결과: t
a = "text"
print(a[3])
print(a[-1])

# 8. 문자열 "abcdefg"에서 "abc" 가 출력되도록 슬라이스하세요
a = "abcdefg"
a[:3]    # "abc"

# 9. 문자열 "abcdefg"에서 "cde" 가 출력되도록 슬라이스하세요
a = "abcdefg"
a[2:5]   # "cde"

# 10. 문자열 "abcdefg"에서 "cdefg" 가 출력되도록 슬라이스하세요
a = "abcdefg"
a[2:]   # "cdefg"

# 11. 문자열 "안녕하세요 반가워요" 에서 슬라이스를 사용해 
# "안녕하세요" 와 "반가워요" 을 각각 출력하세요
a = "안녕하세요 반가워요"
print(a[:5])    # 안녕하세요
print(a[6:])    # 반가워요

# 12. 문자열 "20260112Mon"에서 슬라이스를 사용해
# 연도, 월, 일, 요일을 각각 출력하세요
a = "20260112Mon"
year = a[:4]    #2026
month = a[4:6]  #01
day = a[6:8]    #12
weekday = a[8:] #Mon

# 13. 문자열 함수를 사용해 문자열 "programming"의 길이를 구하세요
# 결과: 11
a = "programming"         
print(len(a))

# 14. 문자열 "2026-01-12"에서 "-"를 "/"로 바꿔 출력하세요
# 결과: 2026/01/12
a = "2026-01-12"
a.replace("-","/")
