# 1.다음 과일과 수량으로 딕셔너리를 만드세요
# 사과 3개, 바나나 5개, 딸기 2개
# 사과의 수량을 10으로 변경하세요
cart = {"사과": 3, "바나나": 5, "딸기": 2}
cart["사과"] = 10

# 2.다음 커피 메뉴와 가격으로 딕셔너리를 만드세요
# 아메리카노 2000원, 라떼 3500원, 케이크 5000원
# 아메리카노 가격을 2500원으로 인상하세요
# 케이크를 메뉴에서 삭제하세요
coffee = {"아메리카노": 2000, "라떼": 3500, "케이크": 5000}
coffee["아메리카노"] = 2500
del coffee["케이크"]

# 아메리카노 2잔 + 라떼 1잔을 주문했을 때 총 금액 계산하세요
total = coffee["아메리카노"] * 2 + coffee["라떼"] * 1
print("총 금액:", total)

# 3.다음 과목과 시험점수로 딕셔너리를 만드세요
# 수학 80점, 영어 90점
# 국어 100점을 추가하세요
score = {"수학": 80, "영어": 90}
score["국어"] = 100

# 전 과목의 총점과 평균을 구하세요
sum = score["수학"] + score["영어"] + score["국어"]
avg = sum / 3   # 80
